Revit 2027 API
FabricationConfiguration.GetUpdatedStraightsFromValidateConnections Method
 Get the set of element identifiers of fabrication part straights that were previously updated. If there were no straights were updated it will return an empty set of element identifiers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetUpdatedStraightsFromValidateConnections()
Public Function GetUpdatedStraightsFromValidateConnections As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetUpdatedStraightsFromValidateConnections()
member GetUpdatedStraightsFromValidateConnections : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 Returns the set of element identifiers of fabrication part straights that were updated.
Remarks
 The set of element identifiers were created by calling ValidateConnectionsForAllFabricationParts with the option updateGapForStraights set to true.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace